
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ФД.УстановитьHTML(Параметры.ХТМЛ, Новый Структура);
КонецПроцедуры

&НаСервере
Функция ПолучитьХТМЛ()
	
	СтрокаХТМЛ = "";
	СтруктураКартинок = Новый Структура;
	
	ФД.ПолучитьHTML(СтрокаХТМЛ, СтруктураКартинок);
	Возврат Новый Структура("ХТМЛ, Картинки", СтрокаХТМЛ, СтруктураКартинок);
	
КонецФункции	

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ЭтаФорма.Закрыть(ПолучитьХТМЛ());
КонецПроцедуры
