#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьДеревоПодсистем();
	
	МакетРС = Обработки.РабочийСтолClouddep.ПолучитьМакет("Макет");
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("grs");
	МакетРС.Записать(ИмяВременногоФайла);
	
	ПолеРабочегоСтола.Прочитать(ИмяВременногоФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
#КонецОбласти

#Область ОбработчикиКомандФормы
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьДеревоПодсистем()

	ЭлементыДереваПервогоУровня = Подсистемы.ПолучитьЭлементы();
	НоваяСтрокаПервогоУровня = ЭлементыДереваПервогоУровня.Добавить();
	НоваяСтрокаПервогоУровня.ИмяПодсистемы = "Рабочий стол";
	НоваяСтрокаПервогоУровня.Картинка = БиблиотекаКартинок.РабочийКаталогПоУмолчанию;
	
	ЭлементыПодсистемыРабочийСтол = НоваяСтрокаПервогоУровня.ПолучитьЭлементы();
	НоваяСтрока = ЭлементыПодсистемыРабочийСтол.Добавить();	
	НоваяСтрока.ИмяПодсистемы = "Новости!";
	
КонецПроцедуры


#Область Обрабочики_подсистемы_Рабочий_стол

&НаКлиенте
Процедура ПолеРабочегоСтолаВыбор(Элемент)
	Если Элемент.ТекущийЭлемент<>Неопределено Тогда
		Сообщить("Сработал Выбор "+ТекущаяДата()+" "+Элемент.ТекущийЭлемент.Имя);
	КонецЕсли;
КонецПроцедуры

	
#КонецОбласти 

#КонецОбласти
