
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СхемаПодбораКонтрагентов = РегистрыСведений.Clouddep_НастройкиАвтозаполненияСоставаГруппыПочтовойРассылки.ПолучитьМакет("СхемаПодбораКонтрагентов");
	АдресСхемы = ПоместитьВоВременноеХранилище(СхемаПодбораКонтрагентов, ЭтаФорма.УникальныйИдентификатор);
	
	Настройка = СхемаПодбораКонтрагентов.НастройкиПоУмолчанию;
	
	ИДН = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы);
	КомпоновщикНастроек.Инициализировать(ИДН);
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройка);
	
	ОбъектФормы = РеквизитФормыВЗначение("Запись");
	СохраненныеНастройки = ОбъектФормы.Настройка.Получить();
	Если СохраненныеНастройки<>Неопределено Тогда
		КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(СохраненныеНастройки);
	ИначеЕсли Не ПустаяСтрока(Параметры.АдресНастроекДляНовойЗаписи) Тогда 
		СохраненныеНастройки = ПолучитьИзВременногоХранилища(Параметры.АдресНастроекДляНовойЗаписи);
		КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(СохраненныеНастройки.Получить());
	КонецЕсли;
	
	Если ПустаяСтрока(Запись.ИдентификаторНастройки) Тогда
		Запись.ИдентификаторНастройки = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Настройка = Новый ХранилищеЗначения(КомпоновщикНастроек.ПользовательскиеНастройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
//Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
//Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//Код процедур и функций
#КонецОбласти
